# translations.py

translations = {
    "a": {"si": "එක", "ta": "ஒரு"},
    "a lot": {"si": "බොහෝ", "ta": "பல"},
    "abdomen": {"si": "අද්ධිය", "ta": "வயிறு"},
    "able": {"si": "හැකියාව", "ta": "முடியும்"},
    "about": {"si": "ගැන", "ta": "பற்றி"},
    "above": {"si": "ඉහළ", "ta": "மேல்"},
    "accept": {"si": "පිළිගන්න", "ta": "ஏற்க"},
    "accent": {"si": "උච්චාරණය", "ta": "உச்சரிப்பு"},
    "accident": {"si": "අනතුර", "ta": "விபத்து"},
    "accomplish": {"si": "සම්පූර්ණ කරන්න", "ta": "நிறைவேற்ற"},
    "accountant": {"si": "ගිණුම්කරු", "ta": "கணக்காளர்"},
    "across": {"si": "අස්සේ", "ta": "அக்கரை"},
    "act": {"si": "ක්‍රියා", "ta": "நடிப்பு"},
    "action": {"si": "ක්‍රියාව", "ta": "நடவடிக்கை"},
    "active": {"si": "සක්‍රිය", "ta": "செயலில்"},
    "activity": {"si": "ක්‍රියාකාරකම්", "ta": "செயல்பாடு"},
    "actor": {"si": "නිළියෙක්", "ta": "நடிகர்"},
    "adapt": {"si": "සංවර්ධනය", "ta": "தகுந்து கொள்ள"},
    "add": {"si": "එක් කරන්න", "ta": "சேர்க்க"},
    "address": {"si": "ලිපිනය", "ta": "முகவரி"}
}
